mhorne/freebsd/share/man/man9/pfind.9
.\" Copyright (c) 2001 Evan Sarmiento.
.\" All rights reserved.
.\" Copyright (c) 2023 The FreeBSD Foundation
.\"
.\" Portions of this documentation were written by Mitchell Horne
.\" under sponsorship from the FreeBSD Foundation.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd January 28, 2023
.Dt PFIND 9
.Os
.Sh NAME
.Nm pfind ,
.Nm pfind_any
.Nd locate a process by numeric ID
.Sh SYNOPSIS
.In sys/param.h
.In sys/proc.h
.Ft "struct proc *"
.Fn pfind "pid_t pid"
.Ft "struct proc *"
.Fn pfind_any "pid_t pid"
.Sh DESCRIPTION
The
.Fn pfind
function walks the list of processes in the system, looking for the one with a
process ID of
.Fa pid .
If the process exists, and is not in the zombie state, a pointer to the process
structure will be returned.
.Pp
The
.Fn pfind_any
function behaves identically to
.Fn pfind ,
except that the lookup does not exclude processes in the zombie state.
.Pp
Both
.Fn pfind
and
.Fn pfind_any
lock the returned process using
.Fn PROC_LOCK "p" .
.Sh RETURN VALUES
.Fn pfind
and
.Fn pfind_any
return a pointer to a
.Vt struct proc
after a successful lookup, and
.Dv NULL
otherwise.
.Sh SEE ALSO
.Xr pget 9 ,
.Xr pgfind 9 ,
.Xr tdfind 9
.Sh AUTHORS
This manual page was written by
.An Evan Sarmiento Aq Mt kaworu@sektor7.ath.cx .
