mhorne/freebsd/share/man/man9/tdfind.9
.\"
.\" Copyright (c) 2023 The FreeBSD Foundation
.\"
.\" This documentation was written by Mitchell Horne <mhorne@FreeBSD.org> under
.\" sponsorship from the FreeBSD Foundation.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd January 28, 2023
.Dt TDFIND 9
.Os
.Sh NAME
.Nm tdfind ,
.Nd locate a thread by numeric ID
.Sh SYNOPSIS
.In sys/param.h
.In sys/proc.h
.Ft "struct thread *"
.Fn tdfind "lwpid_t tid, pid_t pid"
.Sh DESCRIPTION
The
.Fn pfind
function walks the list of processes in the system, looking for the one with a
process ID of
.Fa pid .
If the process exists, and is not in the zombie state, a pointer to the process
structure will be returned.
.Pp
Both
.Fn pfind
and
.Fn pfind_any
lock the returned process using
.Fn PROC_LOCK "p" .
.Sh RETURN VALUES
.Fn pfind
and
.Fn pfind_any
return a pointer to a
.Vt struct proc
after a successful lookup, and
.Dv NULL
otherwise.
.Sh SEE ALSO
.Xr pfind 9 ,
.Xr pgfind 9
.Sh AUTHORS
This manual page was written by
.An Mitchell Horne Aq Mt mhorne@FreeBSD.org .
