mhorne/freebsd/share/man/man9/vm_page_advise.9
.\"
.\" Copyright (C) 2001 Chad David <davidc@acns.ab.ca>. All rights reserved.
.\" Copyright (c) 2023 The FreeBSD Foundation
.\"
.\" Portions of this documentation were written by Mitchell Horne
.\" <mhorne@FreeBSD.org> under sponsorship from the FreeBSD Foundation.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice(s), this list of conditions and the following disclaimer as
.\"    the first lines of this file unmodified other than the possible
.\"    addition of one or more copyright notices.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice(s), this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDER(S) ``AS IS'' AND ANY
.\" EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
.\" DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT HOLDER(S) BE LIABLE FOR ANY
.\" DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
.\" (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
.\" SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
.\" CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH
.\" DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd July 11, 2023
.Dt VM_PAGE_ADVISE 9
.Os
.Sh NAME
.Nm vm_page_advise
.Nd "apply advisory usage hint to a page"
.Sh SYNOPSIS
.In sys/param.h
.In sys/mman.h
.In vm/vm.h
.In vm/vm_page.h
.Ft void
.Fn vm_page_advise "vm_page_t m" "int advice"
.Sh DESCRIPTION
The
.Fn vm_page_advise
function applies the requested advisory action to the page
.Fa m .
.Pp
The values of
.Fa advice
are defined by the
.Xr madvise 2
system call.
Values recognized by this function are:
.Bl -tag -offset -indent -width "Dv MADV_DONTNEED"
.It Dv MADV_DONTNEED
Advise the VM system that the page denoted by
.Fa m
is no longer required.
If the page is already in the inactive queue or in the cache queue, this
function does nothing; otherwise the page is deactivated.
.It Dv MADV_FREE
Advise the VM system that the contents of page
.Fa m
are no longer important.
The page is marked as clean with
.Xr vm_page_undirty 9 .
.It Dv MADV_WILLNEED
Advise the VM system that
.Fa m
will be needed, and put it on the active page queue.
.El
.Sh SEE ALSO
.Xr madvise 2 ,
.Xr vm_page_deactivate 9 ,
.Xr vm_page_undirty 9
.Sh AUTHORS
This manual page was written by
.An Chad David Aq Mt davidc@acns.ab.ca
and revised by
.An Mitchell Horne Aq Mt mhorne@FreeBSD.org .
